cf_billing/InformationRegisters/бестНастройкиКатегорийДебитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНастройкиКатегорийДебитора</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>От</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>До</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияДебитора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКатегорииДебитора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестНастройкиКатегорийДебитора/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьКатегориюДебитора(Период, Организация, ДниЗадолженности) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестНастройкиКатегорийДебитораСрезПоследних.КатегорияДебитора КАК КатегорияДебитора
		|ИЗ
		|	РегистрСведений.бестНастройкиКатегорийДебитора.СрезПоследних(&Период, Организация = &Организация) КАК бестНастройкиКатегорийДебитораСрезПоследних
		|ГДЕ
		|	бестНастройкиКатегорийДебитораСрезПоследних.От <= &ДниЗадолженности
		|	И ВЫБОР
		|			КОГДА бестНастройкиКатегорийДебитораСрезПоследних.До = 0
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ &ДниЗадолженности < бестНастройкиКатегорийДебитораСрезПоследних.До
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ДниЗадолженности", 	ДниЗадолженности);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Период", 			Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.КатегорияДебитора;
	КонецЕсли;
	
	Возврат Справочники.бестКатегорииДебитора.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
